# SpatialElementDomainData Properties

---
The SpatialElementDomainData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
SpatialElementDomainData Class
Autodesk.Revit.DB Namespace